In [1]:
import pandas as pd
import numpy as np
import mysql.connector

In [2]:

# Example: Reading a file with specific encoding
file_path = 'C:/Users/HP/Desktop/files/Customers.csv'

try:
    df = pd.read_csv(file_path, encoding='ISO-8859-1')  # or try 'cp1252'
    print(df.head())
except UnicodeDecodeError:
    print("Failed to decode the file with the specified encoding.")

   CustomerKey  Gender               Name            City State Code  \
0          301  Female      Lilly Harding  WANDEARAH EAST         SA
1          325  Female       Madison Hull      MOUNT BUDD         WA
2          554  Female      Claire Ferres       WINJALLOK        VIC
3          786    Male  Jai Poltpalingada    MIDDLE RIVER         SA
4         1042    Male    Aidan Pankhurst   TAWONGA SOUTH        VIC

               State Zip Code    Country  Continent    Birthday
0    South Australia     5523  Australia  Australia    7/3/1939
1  Western Australia     6522  Australia  Australia   9/27/1979
2           Victoria     3380  Australia  Australia   5/26/1947
3    South Australia     5223  Australia  Australia   9/17/1957
4           Victoria     3698  Australia  Australia  11/19/1965

In [24]:
df['Birthday'] = pd.to_datetime(df['Birthday'])
df.drop('State Code', axis=1, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15256 entries, 0 to 15265
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15256 non-null  int64
 1   Gender       15256 non-null  object
 2   Name         15256 non-null  object
 3   City         15256 non-null  object
 4   State        15256 non-null  object
 5   Zip Code     15256 non-null  object
 6   Country      15256 non-null  object
 7   Continent    15256 non-null  object
 8   Birthday     15256 non-null  datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(7)
memory usage: 1.7+ MB

In [4]:
df.to_csv('C:/Users/HP/Desktop/files/all details/customer_data.csv', index=False)

In [5]:
df1=pd.read_csv('C:/Users/HP/Desktop/files/Sales.csv')
df1

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2/20/2021,NaN,1216913,43,632,3,USD
62880,2243031,1,2/20/2021,2/24/2021,511229,0,98,4,EUR
62881,2243032,1,2/20/2021,2/23/2021,331277,0,1613,2,CAD
62882,2243032,2,2/20/2021,2/23/2021,331277,0,1717,2,CAD
62883,2243032,3,2/20/2021,2/23/2021,331277,0,464,7,CAD

In [6]:
df1['Order Date'] = pd.to_datetime(df1['Order Date'])
df1['Delivery Date'] = pd.to_datetime(df1['Delivery Date'])


df1['Delivery Delta'] = (df1['Delivery Date'] - df1['Order Date']).dt.days


mean_delivery_time = df1['Delivery Delta'].mean()


df1['Delivery Date'] = df1['Delivery Date'].fillna(df1['Order Date'] + pd.Timedelta(days=mean_delivery_time))

# At this point, 'Delivery Date' is still in datetime format

# Optionally drop the 'Delivery Delta' column if no longer needed
df1.drop(columns=['Delivery Delta'], inplace=True)

# Format the 'Delivery Date' to mm/dd/yyyy as a string
df1['Delivery Date'] = df1['Delivery Date'].dt.strftime('%m/%d/%Y')

# Display the updated DataFrame
print('successful')

successful

In [7]:
df1['Delivery Date'] = pd.to_datetime(df1['Delivery Date'])

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  datetime64[ns]
 3   Delivery Date  62884 non-null  datetime64[ns]
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: datetime64[ns](2), int64(6), object(1)
memory usage: 4.3+ MB

In [9]:
df2=pd.read_csv('C:/Users/HP/Desktop/files/Products.csv')
df2

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio
...,...,...,...,...,...,...,...,...,...,...
2512,2513,Contoso Bluetooth Active Headphones L15 Red,Contoso,Red,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2513,2514,Contoso Bluetooth Active Headphones L15 White,Contoso,White,$43.07,$129.99,505,Cell phones Accessories,5,Cell phones
2514,2515,Contoso In-Line Coupler E180 White,Contoso,White,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2515,2516,Contoso In-Line Coupler E180 Black,Contoso,Black,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones
2516,2517,Contoso In-Line Coupler E180 Silver,Contoso,Silver,$1.71,$3.35,505,Cell phones Accessories,5,Cell phones

In [10]:
# Removing dollar signs and commas
df2['Unit Price USD'] =df2['Unit Price USD'].str.replace('$', '', regex=False).str.replace(',', '', regex=False).astype(float)
df2['Unit Cost USD'] =df2['Unit Cost USD'].str.replace('$', '', regex=False).str.replace(',', '', regex=False).astype(float)

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [12]:
df3=pd.read_csv('C:/Users/HP/Desktop/files/Stores.csv')
df3

,StoreKey,Country,State,Square Meters,Open Date
0,1,Australia,Australian Capital Territory,595.0,1/1/2008
1,2,Australia,Northern Territory,665.0,1/12/2008
2,3,Australia,South Australia,2000.0,1/7/2012
3,4,Australia,Tasmania,2000.0,1/1/2010
4,5,Australia,Victoria,2000.0,12/9/2015
...,...,...,...,...,...
62,63,United States,Utah,2000.0,3/6/2008
63,64,United States,Washington DC,1330.0,1/1/2010
64,65,United States,West Virginia,1785.0,1/1/2012
65,66,United States,Wyoming,840.0,1/1/2014
66,0,Online,Online,NaN,1/1/2010

In [13]:
df3.drop(df3[df3['Country'] == 'Online'].index, inplace=True)

In [57]:
df3['Open Date'] = pd.to_datetime(df3['Open Date'])

In [58]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       66 non-null     int64
 1   Country        66 non-null     object
 2   State          66 non-null     object
 3   Square Meters  66 non-null     float64
 4   Open Date      66 non-null     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 2.7+ KB

In [63]:
df4=pd.read_csv('C:/Users/HP/Desktop/files/Exchange_Rates.csv')
df4

            Date Currency Code  Exchange
0       1/1/2015           USD    1.0000
1       1/1/2015           CAD    1.1583
2       1/1/2015           AUD    1.2214
3       1/1/2015           EUR    0.8237
4       1/1/2015           GBP    0.6415
...          ...           ...       ...
11210  2/20/2021           USD    1.0000
11211  2/20/2021           CAD    1.2610
11212  2/20/2021           AUD    1.2723
11213  2/20/2021           EUR    0.8238
11214  2/20/2021           GBP    0.7126

[11215 rows x 3 columns]

In [65]:
df4['Date'] = pd.to_datetime(df4['Date'])

In [66]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           11215 non-null  datetime64[ns]
 1   Currency Code  11215 non-null  object
 2   Exchange       11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

Creating sql queries

In [33]:
conn=mysql.connector.connect(host="localhost", username="root", password="Mangesh@6305", database="g_electronics")
my_cursor=conn.cursor()
my_cursor.execute("CREATE DATABASE IF NOT EXISTS g_electronics")

In [25]:
# Creating a cursor object to execute SQL queries
my_cursor = conn.cursor()

# SQL query to create the table
my_cursor.execute('''
    CREATE TABLE IF NOT EXISTS customer_detail (
        CustomerKey INT NOT NULL,
        Gender VARCHAR(10) NOT NULL,
        Name VARCHAR(255) NOT NULL,
        City VARCHAR(255) NOT NULL,
        State VARCHAR(100) NOT NULL,
        `Zip Code` VARCHAR(50) NOT NULL,
        Country VARCHAR(100) NOT NULL,
        Continent VARCHAR(100) NOT NULL,
        Birthday DATE NOT NULL,
        PRIMARY KEY (CustomerKey)
    )
''')
print('successfull')

successfull

In [26]:
insert_query = '''
    INSERT INTO customer_detail (
        CustomerKey, Gender, Name, City, State, `Zip Code`, Country, Continent, Birthday
    ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)
'''
# Example data, assuming you have a pandas DataFrame df`
data = df.values.tolist()

# Executing the insert query
my_cursor.executemany(insert_query, data)

# Committing the changes
conn.commit()

# Printing success message
print("Values inserted successfully!")

Values inserted successfully!

SALES

In [49]:
# Creating a cursor object to execute SQL queries
my_cursor = conn.cursor()

# SQL query to create the table
my_cursor.execute('''
    CREATE TABLE IF NOT EXISTS sales (
        `Order Number` INT NOT NULL,
        `Line_item` INT NOT NULL,
        `Order_date` DATE NOT NULL,
        `Delivery_date` DATE NOT NULL,
        customer_key INT NOT NULL,
        store_key INT NOT NULL,
        product_key INT NOT NULL,
        Quantity INT NOT NULL,
        currency_code VARCHAR(50) NOT NULL
    );
''')
print('Successful')

Successful

In [50]:
insert_query = '''
    INSERT INTO sales (
        `Order Number`, `Line_item`, `Order_date`, `Delivery_date`, customer_key, store_key, product_key, Quantity, currency_code
    ) VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s)
'''
# Example data, assuming you have a pandas DataFrame `df1`
data = df1.values.tolist()

# Executing the insert query
my_cursor.executemany(insert_query, data)

# Committing the changes
conn.commit()

# Printing success message
print("Values inserted successfully!")

Values inserted successfully!

PRODUCT DETAILS

In [51]:
# Creating a cursor object to execute SQL queries
my_cursor = conn.cursor()

# SQL query to create the table
my_cursor.execute('''
    CREATE TABLE IF NOT EXISTS product_details (
        ProductKey INT NOT NULL,
        `Product Name` VARCHAR(255) NOT NULL,
        Brand VARCHAR(255) NOT NULL,
        Color VARCHAR(50) NOT NULL,
        `Unit Cost USD` FLOAT NOT NULL,
        `Unit Price USD` FLOAT NOT NULL,
        SubcategoryKey INT NOT NULL,
        Subcategory VARCHAR(255) NOT NULL,
        CategoryKey INT NOT NULL,
        Category VARCHAR(255) NOT NULL
    );
''')
print('Table created successfully')

Table created successfully

In [54]:
# Creating a cursor object to execute SQL queries
my_cursor = conn.cursor()

# Insert query to add a row to the product_details table
insert_query = '''
    INSERT INTO product_details 
    (ProductKey, `Product Name`, Brand, Color, `Unit Cost USD`, `Unit Price USD`, SubcategoryKey, Subcategory, CategoryKey, Category)
    VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
'''

data = df2.values.tolist()

# Executing the insert query
my_cursor.executemany(insert_query, data)

# Committing the transaction
conn.commit()

print('Row inserted successfully')

Row inserted successfully

STORE

In [55]:
# Creating a cursor object to execute SQL queries
my_cursor = conn.cursor()

# SQL query to create the table
my_cursor.execute('''
    CREATE TABLE IF NOT EXISTS store_details (
        StoreKey INT NOT NULL,
        Country VARCHAR(100) NOT NULL,
        State VARCHAR(100) NOT NULL,
        `Square Meters` FLOAT NOT NULL,
        `Open Date` DATE NOT NULL
    );
''')
print('Table created successfully')

Table created successfully

In [59]:
# Insert query to add a row to the store_details table
insert_query = '''
    INSERT INTO store_details 
    (StoreKey, Country, State, `Square Meters`, `Open Date`)
    VALUES (%s, %s, %s, %s, %s)
'''

data = df3.values.tolist()

# Executing the insert query
my_cursor.executemany(insert_query, data)

# Committing the transaction
conn.commit()

print('Row inserted successfully')

Row inserted successfully

CURRENCY EXCHANGE

In [60]:
# Creating a cursor object to execute SQL queries
my_cursor = conn.cursor()

# SQL query to create the table
my_cursor.execute('''
    CREATE TABLE IF NOT EXISTS currency_exchange (
        Date DATE NOT NULL,
        `Currency Code` VARCHAR(3) NOT NULL,
        Exchange FLOAT NOT NULL
    );
''')
print('Table created successfully')

Table created successfully

In [67]:
# Insert query to add a row to the currency_exchange table
insert_query = '''
    INSERT INTO currency_exchange 
    (Date, `Currency Code`, Exchange)
    VALUES (%s, %s, %s)
'''
data=df4.values.tolist()
# Executing the insert query
my_cursor.executemany(insert_query, data)

# Committing the transaction
conn.commit()

print('Row inserted successfully')

Row inserted successfully